app/controllers/gadget_controller.rb

  def register
    owner_data = JSON.parse(params['owner'])
    viewer_data = JSON.parse(params['viewer'])
    friends_data = JSON.parse(params['friends'])

    owner = User.create_or_update(owner_data)
    viewer = User.create_or_update(viewer_data)

    owner.logged_at = Time.now
    if owner == viewer && owner.joined_at.nil?
      owner.joined_at = Time.now
    end

    curr_friend_user_ids = []
    friends_data.each do |friend_data|
      next if !friend_data["nickname"] #アプリ使用不可ユーザ

      user = User.create_or_update(friend_data)
      owner.friends << user unless owner.friends.member?(user)
      curr_friend_user_ids << user.id
    end

    owner.friend_ships.each do |friend_ship|
      friend_ship.destroy unless curr_friend_user_ids.member?(friend_ship.friend_id)
    end

    owner.save

    session[:owner] = User.find(owner.id, :include => :friends)
---
INSERT INTO `users` (`updated_at`, `mixi_id`, `joined_at`, `nickname`, `deleted_at`, `logged_at`, `profile_url`, `thumbnail_url`, `created_at`) VALUES('2009-08-27 05:52:35', '47028', NULL, NULL, NULL, NULL, NULL, NULL, '2009-08-27 05:52:35')
SELECT `friends`.* FROM `friends` WHERE (`friends`.user_id = 1)
INSERT INTO `friends` (`updated_at`, `user_id`, `friend_id`, `created_at`) VALUES('2009-08-27 05:53:16', 1, 2, '2009-08-27 05:53:16')
SELECT `users`.* FROM `users` INNER JOIN `friends` ON `users`.id = `friends`.friend_id WHERE ((`friends`.user_id = 1)) AND (users.deleted_at IS NULL OR users.deleted_at > '2009-08-27 05:53:16') ORDER BY users.mixi_id asc
DELETE FROM `friends` WHERE `id` = 18
UPDATE `users` SET `thumbnail_url` = 'http://profile.img.mixi.jp/photo/member/70/28/47028_3137173804s.jpg', `nickname` = 'あらい', `updated_at` = '2009-08-27 05:52:35' WHERE `id` = 1
SELECT * FROM `users` WHERE (`users`.`id` IN (22,11,6,23,12,7,24,13,8,25,14,9,26,15,27,16,28,17,30,29,18,2,20,19,3,21,10,4,5)) AND (users.deleted_at IS NULL OR users.deleted_at > '2009-08-27 05:53:17')